{
  "full_name": "Aly Abdelwahed",
  "name": "Aly",
  "current_role": "Analyst | Applications Developer",
  "location": "Mississauga, ON, Canada",
  "email": "aly.abdelwahed@alumni.utoronto.ca",
  "linkedin": "https://www.linkedin.com/in/aly-abdelwahed/",
  "specialties": [
    "Oracle Fusion Cloud Integrations (ERP, HCM, EPM)",
    "Cloud Infrastructure & DevOps Automation",
    "AI and Data Engineering Solutions"
  ],
  "years_experience": 2,
  "education": [
    {
      "degree": "Honours Bachelor of Science in Computer Science (Specialist in Statistical Machine Learning and Data Science, Co-op)",
      "institution": "University of Toronto",
      "year": "2024"
    }
  ],
  "work_experience": [
    {
      "company": "Novamodus Solutions Inc",
      "location": "Mississauga, ON",
      "title": "Business Technology Analyst | Applications Developer",
      "period": "Jul 2024 – Present",
      "type": "Full-Time",
      "responsibilities": [
        "Operated in a client-facing consulting role, collaborating with stakeholders to translate business requirements into technical solutions, present findings, clarify scope, and support delivery across multiple external client projects.",
        "Designed and implemented data models across all C#-based integrations to support efficient ingestion, transformation, validation, and interaction with REST and SOAP APIs, resulting in scalable and reusable architectures.",
        "Developed and deployed multiple Oracle Time and Labour integrations using C# .NET Core Azure Functions, REST APIs, and SOAP APIs to automate processing of 30,000+ time entries from systems such as Trapeze and Microsoft Shifts into Oracle Fusion HCM, with built-in exception reporting and failure handling.",
        "Built an automated .NET Core (C#) integration to process SAP files and generate HDL batches, submitting and polling process status through REST APIs and retrieving results via BI Publisher SOAP reports.",
        "Developed and deployed 5+ Azure Functions in Azure DevOps, implementing robust ETL pipelines synchronizing data between cloud SaaS platforms and Oracle Fusion ERP/HCM.",
        "Resolved critical bugs across Oracle Visual Builder applications, OIC integrations, and Oracle ATP stored procedures to restore data integrity and system functionality.",
        "Built SQL-based reporting solutions spanning Oracle Fusion subject areas including Payroll, Assignments, Personnel, and Compensation.",
        "Worked in Agile teams, participating in sprint planning, standups, code reviews, and maintaining technical documentation and test plans."
      ],
      "technologies": [
        "Python",
        "C#",
        ".NET",
        ".NET Core",
        "Oracle ERP",
        "Oracle HCM",
        "Oracle EPM",
        "Oracle Visual Builder",
        "Oracle Integration Cloud (OIC)",
        "Oracle ATP",
        "Azure Functions",
        "Azure DevOps",
        "REST APIs",
        "SOAP APIs",
        "SQL",
        "PL/SQL",
        "JavaScript",
        "Jira"
      ]
    }
  ],
  "projects": [
    {
      "name": "Cybersecurity Analyzer Platform",
      "link": "https://github.com/alyab16/Cybersecurity-Analyzer",
      "description": "Designed and implemented an end-to-end, containerized cybersecurity analysis platform composed of a FastAPI orchestration service and multiple TensorFlow-based ML microservices for vulnerability detection and secrets scanning. Built a full cloud-native deployment pipeline using Docker Compose for local development, Terraform for infrastructure provisioning across AWS and Azure, and GitHub Actions CI/CD with OpenID Connect (OIDC) authentication. Implemented automated Docker image builds, tagging, and publishing to Amazon ECR and Azure Container Registry, along with secure IAM role design, environment configuration, and infrastructure state management. Debugged and resolved production-grade issues including image pull failures, IAM permission errors, Terraform state drift, and multi-service dependency orchestration."
    },
    {
      "name": "Helpdesk Triage Agent",
      "link": "https://github.com/alyab16/helpdesk-triage-agent",
      "description": "FastAPI service combining a PyTorch sentiment classifier (DistilBERT SST-2) with LangGraph and LangChain for automated ticket triage, supporting CUDA/MPS/CPU with GPU half-precision inference."
    },
    {
      "name": "Flagging Loans Project",
      "link": "https://github.com/alyab16/Flagging-Loans",
      "description": "Built a predictive model for loan risk assessment using Python, Scikit-learn, Pandas, and NumPy, achieving strong accuracy on imbalanced datasets."
    },
    {
      "name": "Top 1500 Steam Games Analysis",
      "link": "https://github.com/alyab16/Top-1500-Games-On-Steam/tree/main",
      "description": "Analyzed Steam’s top 1500 games by revenue; implemented a Gradient Boosting Regressor to predict game prices with 78% accuracy."
    },
    {
      "name": "Age Related Risk Analysis of COVID-19 Outcomes",
      "link": "https://github.com/alyab16/Age-Related-Risk-Analysis-of-COVID-19-Outcomes",
      "description": "Used R Markdown, logistic regression, and bootstrap tests to analyze age-dependent COVID-19 mortality risks, validated with k-fold cross-validation."
    }
  ],
  "skills": {
    "programming_languages": [
      "Python",
      "Java",
      "C#",
      "SQL (MySQL & PostgreSQL)",
      ".NET Core",
      ".NET Framework",
      "R"
    ],
    "deep_learning_and_llm": [
      "PyTorch",
      "TensorFlow",
      "LangChain",
      "LangGraph",
      "Autogen",
      "CrewAI",
      "MCP"
    ],
    "machine_learning": [
      "NVIDIA RAPIDS",
      "Scikit-Learn",
      "Pandas",
      "NumPy",
      "Polars",
      "Matplotlib",
      "Seaborn"
    ],
    "cloud_and_devops": [
      "AWS (ECR, ECS, IAM, VPC, CloudWatch)",
      "Azure (Container Apps, ACR, Functions)",
      "Terraform",
      "Docker",
      "Docker Compose",
      "GitHub Actions",
      "OIDC",
      "CI/CD Pipelines",
      "Infrastructure as Code"
    ],
    "other_tools": [
      "FastAPI",
      "HuggingFace Transformers",
      "RESTful APIs",
      "SOAP APIs",
      "Pydantic",
      "Git",
      "JSON"
    ],
    "interpersonal_skills": [
      "Cross-functional Collaboration",
      "Quick Learning",
      "Adaptability",
      "Teamwork",
      "Problem-Solving",
      "Communication",
      "Critical Thinking"
    ]
  }
}
